tests/load/load-all.yml
config:
  environments:
    local:
      target: http://localhost:3500
      phases:
        - duration: 30
          arrivalRate: 7
scenarios:
  - name: "Test Post"
    flow:
      - patch:
          url: "/post"
      - post:
          url: "/post"
          json:
            title: "Test Title"
            body: "Test Body"
            userId: 2
          capture:
            - json: "$.id"
              as: "id"
      - put:
          url: "/post/{{ id }}"
          json:
            title: "Updated Test Title"
            body: "Updated Test Body"
      - delete:
          url: "/post/{{ id }}"
      - get:
          url: "/post"
  - name: "Test User"
    flow:
      - post:
          url: "/user"
          json:
            name: "TestUser"
            email: "testuser@uol.com.br"
            password: "Password123!!"
      - get:
          url: "/user"
  - name: "Test Log"
    flow:
      - get:
          url: "/logs"
  - name: "Test Auth"
    flow:
      - post:
          url: "/auth/signup"
          json:
            name: "TestUser"
            email: "testuser@sub.com.br"
            password: "Password123!!"
      - post:
          url: "/auth/signin"
          json:
            email: "testuser@sub.com.br"
            password: "Password123!!"